#  GIT - 

#  Это система для отслеживания и ведения истории изменения 


# Репозиторий - хранилище вашего кода и истории его изменений

# GITHub - это вэб сайт для размещения git - репозитроиев и совместной разработки проектов


# Комнда GIT

# 1. git init - она создает новый git репозиторий локально на вашем ПК
# 2. git commit - как только мы достигаем определенного момента в разработке, то тогда мы сохраняем и комментим изменения.(фиксация изменений в репо).
#  git commit -m '<comment>
# 3. git add . когда мы создаем или измененяем файлы, то при помощи этой комманды мы загружаем все изменения в локальное хранилище

# git add - <название файла>
# git add . 


# 4. git remote add - это команда для того чтобы связать ваш проект с удаленным репози(репо в гитхаб)
# git remote add <название подключения> <ссылка на репо>
# git remote add origin <url>

# 5. git push - после коммита изменений при помощи этой команды мы отправляем наши изменения на удаленный репозиторий
#  git push <название ветки>

"========================"

# 6. git branch  Ветки очень важны  в git. При помощи веток несколько несколько программистов могут работать параллельно на одном и том же проекте. при помощи команды git branch мы можем создавать, просмотривать или удалять ветки
# создание ветки: git branch <название ветки>
# просмотр ветки: git branch or git branch --list
# удаление ветки 


# 7. git checkout - команда используется для работы в команде, она помогает переключаться по веткам
# git checkout <название ветки>

строчка ветки main_2.0